GHB2/src/InformationRegisters/гхб_ПлощадиПомещений/гхб_ПлощадиПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ПлощадиПомещений</name>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_СвойстваПомещений/гхб_СвойстваПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СвойстваПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСтроения</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПомещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДробнаяЧасть</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПомещения</name>
    <type>
      <types>CatalogRef.гхб_ТипыПомещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеКоличествоРабочихМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетРабочихМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточняющаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНаГенеральномПлане</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступВПомещениеПоКлючу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеОхраннойСигнализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомерКТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеКТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеДоступаСВысшимРуководителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщегоПользования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ПлощадиПомещений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПлощадиПомещений() Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_СвойстваПомещенийСрезПоследних.Локация КАК Помещение,
	               |	СУММА(гхб_СвойстваПомещенийСрезПоследних.Площадь) КАК Площадь
	               |ПОМЕСТИТЬ _ПомещенияПлощади
	               |ИЗ
	               |	РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
	               |ГДЕ
	               |	гхб_СвойстваПомещенийСрезПоследних.ТипПомещения.ЭтоПомещение
	               |	И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	гхб_СвойстваПомещенийСрезПоследних.Локация
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	гхб_СвойстваПомещенийСрезПоследних.Корпус,
	               |	СУММА(гхб_СвойстваПомещенийСрезПоследних.Площадь)
	               |ИЗ
	               |	РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
	               |ГДЕ
	               |	гхб_СвойстваПомещенийСрезПоследних.ТипПомещения.ЭтоПомещение
	               |	И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	гхб_СвойстваПомещенийСрезПоследних.Корпус
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	гхб_СвойстваПомещенийСрезПоследних.ЭлементСтроения,
	               |	СУММА(гхб_СвойстваПомещенийСрезПоследних.Площадь)
	               |ИЗ
	               |	РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
	               |ГДЕ
	               |	гхб_СвойстваПомещенийСрезПоследних.ТипПомещения.ЭтоПомещение
	               |	И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	гхб_СвойстваПомещенийСрезПоследних.ЭлементСтроения
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Помещение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	гхб_Помещения.Ссылка КАК Помещение,
	               |	ЕСТЬNULL(_ПомещенияПлощади.Площадь, 0) КАК Площадь
	               |ИЗ
	               |	Справочник.гхб_Помещения КАК гхб_Помещения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _ПомещенияПлощади КАК _ПомещенияПлощади
	               |		ПО гхб_Помещения.Ссылка = _ПомещенияПлощади.Помещение
	               |ГДЕ
	               |	гхб_Помещения.ЭтоГруппа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ _ПомещенияПлощади";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.гхб_ПлощадиПомещений.СоздатьМенеджерЗаписи();
		МЗ.Помещение = Выборка.Помещение;
		МЗ.Площадь = Выборка.Площадь;
		МЗ.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
